# Pandas Assignment 2 (A)



### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset

In [2]:
df=pd.read_csv('Pandas Assignment 2A.csv')
df

         Unnamed: 0       Id     Name  Year Gender State  Count
0             11349    11350     Emma  2004      F    AK     62
1             11350    11351  Madison  2004      F    AK     48
2             11351    11352   Hannah  2004      F    AK     46
3             11352    11353    Grace  2004      F    AK     44
4             11353    11354    Emily  2004      F    AK     41
...             ...      ...      ...   ...    ...   ...    ...
1016390     5647421  5647422     Seth  2014      M    WY      5
1016391     5647422  5647423  Spencer  2014      M    WY      5
1016392     5647423  5647424     Tyce  2014      M    WY      5
1016393     5647424  5647425   Victor  2014      M    WY      5
1016394     5647425  5647426   Waylon  2014      M    WY      5

[1016395 rows x 7 columns]

In [3]:
df.index

RangeIndex(start=0, stop=1016395, step=1)

In [17]:
df.axes

[RangeIndex(start=0, stop=1016395, step=1),
 Index(['Unnamed: 0', 'Id', 'Name', 'Year', 'Gender', 'State', 'Count'], dtype='object')]

### Step 3. Assign it to a variable called baby_names.

In [59]:
baby_names=df.copy()

### Step 4. See the first 10 entries

In [50]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [60]:
baby_names.drop(['Unnamed: 0','Id'],axis=1,inplace=True)
baby_names.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

### Step 6. Is there more male or female names in the dataset?

In [15]:
baby_names['Gender'].value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

In [7]:
F=baby_names['Gender'].value_counts()['F']
M=baby_names['Gender'].value_counts()['M']
if F>M:
    print('Females are more')
else:
     print('Males are more')

Females are more

### Step 7. Group the dataset by name and assign to names

In [21]:
names=baby_names.groupby('Name')
names

In [19]:
names.first() # prints the 1st row where the unique name occurs

         Year Gender State  Count
Name
Aaban    2013      M    NY      6
Aadan    2008      M    CA      7
Aadarsh  2009      M    IL      5
Aaden    2007      M    AL      5
Aadhav   2014      M    CA      6
...       ...    ...   ...    ...
Zyra     2012      F    CA      6
Zyrah    2011      F    CA      5
Zyren    2013      M    TX      6
Zyria    2007      F    GA      6
Zyriah   2007      F    GA      5

[17632 rows x 4 columns]

### Step 8. How many different names exist in the dataset?

In [9]:
n=names['Name'].unique()
len(n)

17632

In [23]:
names['Name'].nunique()

Name
Aaban      1
Aadan      1
Aadarsh    1
Aaden      1
Aadhav     1
          ..
Zyra       1
Zyrah      1
Zyren      1
Zyria      1
Zyriah     1
Name: Name, Length: 17632, dtype: int64

In [24]:
baby_names['Name'].nunique()

17632

### Step 9. What is the name with most occurrences?

In [26]:
baby_names['Name'].mode()
#baby_names['Name'].value_counts().idxmax()

0    Riley
dtype: object

In [11]:
baby_names['Name'].value_counts().head(1)

Riley    1112
Name: Name, dtype: int64

In [28]:
baby_names['Name'].value_counts().max()

1112

### Step 10. How many different names have the least occurrences?

In [12]:
baby_names['Name'].value_counts().tail(20)

Brenae       1
Ahmiyah      1
Sarae        1
Xolani       1
Zanaria      1
Fabianna     1
Raziah       1
Shalimar     1
Andreanna    1
Damiah       1
Izaria       1
Laiyla       1
Lyrica       1
Naika        1
Somya        1
Terryn       1
Yanna        1
Zemirah      1
Emmilyn      1
Coalton      1
Name: Name, dtype: int64

In [46]:
baby_names['Name'].value_counts(ascending=True).reset_index(name='count')

        index  count
0      Karlyn      1
1      Montae      1
2       Leeon      1
3        Jedi      1
4       Edahi      1
...       ...    ...
17627  Hayden   1049
17628  Peyton   1064
17629  Jordan   1073
17630   Avery   1080
17631   Riley   1112

[17632 rows x 2 columns]

In [39]:
least_occur=baby_names['Name'].value_counts(ascending=True).reset_index(name='count')

In [40]:
least_occur[least_occur['count']==1]

            index  count
0          Karlyn      1
1          Montae      1
2           Leeon      1
3            Jedi      1
4           Edahi      1
...           ...    ...
3677       Keonta      1
3678        Somer      1
3679  Quinterrius      1
3680   Emmaclaire      1
3681           La      1

[3682 rows x 2 columns]

### Step 11. What is the median name occurrence?

In [61]:
baby_names.sort_values('Name',inplace=True)
baby_names

          Name  Year Gender State  Count
693699   Aaban  2013      M    NY      6
695768   Aaban  2014      M    NY      6
897674   Aadan  2008      M    TX      5
120728   Aadan  2008      M    CA      7
138678   Aadan  2014      M    CA      5
...        ...   ...    ...   ...    ...
885288  Zyriah  2014      F    TX      6
867512  Zyriah  2009      F    TX      5
881208  Zyriah  2013      F    TX      7
855869  Zyriah  2006      F    TX      6
244816  Zyriah  2012      F    GA      5

[1016395 rows x 5 columns]

In [62]:
baby_names.reset_index(drop=True,inplace=True)
baby_names

           Name  Year Gender State  Count
0         Aaban  2013      M    NY      6
1         Aaban  2014      M    NY      6
2         Aadan  2008      M    TX      5
3         Aadan  2008      M    CA      7
4         Aadan  2014      M    CA      5
...         ...   ...    ...   ...    ...
1016390  Zyriah  2014      F    TX      6
1016391  Zyriah  2009      F    TX      5
1016392  Zyriah  2013      F    TX      7
1016393  Zyriah  2006      F    TX      6
1016394  Zyriah  2012      F    GA      5

[1016395 rows x 5 columns]

In [63]:
baby_names.index

RangeIndex(start=0, stop=1016395, step=1)

In [64]:
baby_names.iloc[round(1016394/2)]

Name      Jocelyn
Year         2004
Gender          F
State          OR
Count          42
Name: 508197, dtype: object

In [66]:
baby_names.iloc[round(1016394/2),0]

'Jocelyn'

In [65]:
baby_names.iloc[round(1016394/2)]['Name']

'Jocelyn'

### Step 12. What is the standard deviation of names?

In [68]:
baby_names['Count'].std()

97.39734648622601

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [67]:
baby_names.describe()

               Year         Count
count  1.016395e+06  1.016395e+06
mean   2.009053e+03  3.485012e+01
std    3.138293e+00  9.739735e+01
min    2.004000e+03  5.000000e+00
25%    2.006000e+03  7.000000e+00
50%    2.009000e+03  1.100000e+01
75%    2.012000e+03  2.600000e+01
max    2.014000e+03  4.167000e+03

In [69]:
round(baby_names.describe())

            Year      Count
count  1016395.0  1016395.0
mean      2009.0       35.0
std          3.0       97.0
min       2004.0        5.0
25%       2006.0        7.0
50%       2009.0       11.0
75%       2012.0       26.0
max       2014.0     4167.0